### 1. Import Pandas

In [287]:
import pandas as pd

### 2. Print Version of Pandas

In [288]:
pd.__version__

'2.2.2'

### 3. Print out all the version information of the libraries that are required by the pandas library.

In [289]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : d9cdd2ee5a58015ef6f4d15c7226110c9aab8140
python                : 3.12.3.final.0
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.21996
machine               : AMD64
processor             : Intel64 Family 6 Model 60 Stepping 3, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_United States.1252

pandas                : 2.2.2
numpy                 : 1.26.4
pytz                  : 2024.1
dateutil              : 2.8.2
setuptools            : None
pip                   : 24.0
Cython                : None
pytest                : None
hypothesis            : None
sphinx                : None
blosc                 : None
feather               : None
xlsxwriter            : None
lxml.etree            : None
html5lib              : None
pymysql               : None
psycopg2              : None
jinja2                : None
IPython               : 8.18.1
pandas_datareader     : None
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : 4.12.3
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
gcsfs                 : None
matplotlib            : None
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.2
pandas_gbq            : None
pyarrow               : None
pyreadstat            : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : None
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
zstandard             : None
tzdata                : 2024.1
qtpy                  : None
pyqt5                 : None

## DataFrame basics
### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames
##### Difficulty: easy

### 4. Create a DataFrame df from this dictionary data which has the index labels.

In [290]:
import numpy as np 

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [291]:
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

### 5. Display a summary of the basic information about this DataFrame and its data (hint: there is a single method that can be called on the DataFrame).

In [292]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [293]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

### 6. Return the first 3 rows of the DataFrame df.

In [294]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [295]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [296]:
df.tail(3)

  animal  age  visits priority
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

### 7. Select just the 'animal' and 'age' columns from the DataFrame df.

In [297]:
df[["animal","age"]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

### 8. Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

In [298]:
df[["animal","age"]].iloc[[3,4,8]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

### 9. Select only the rows where the number of visits is greater than 3.

In [299]:
df.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

In [300]:
df[df["visits"] > 2]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

### 10. Select the rows where the age is missing, i.e. it is NaN.

In [301]:
df.isna()

   animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False   True   False     False
e   False  False   False     False
f   False  False   False     False
g   False  False   False     False
h   False   True   False     False
i   False  False   False     False
j   False  False   False     False

In [302]:
df[df["age"].isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

### 11. Select the rows where the animal is a cat and the age is less than 3.

In [303]:
df[(df.animal=="cat")&(df.age < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

### 12. Select the rows where age is between 2 and 4 (inclusive).

In [304]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [305]:
df[(df.age>=2)&(df.age <= 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

### 13. Change the age in row 'f' to 1.5.

In [306]:
df.loc['f', 'age'] = 1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

### 14. Calculate the sum of all visits in df (i.e. find the total number of visits).

In [307]:
df.sum()['visits']

19

### 15. Calculate the mean age for each different animal in df.

In [308]:
df.age.mean()

3.375

In [309]:
g= df.groupby('animal')

In [310]:
g.get_group("cat")

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  1.5       3       no
h    cat  NaN       1      yes

In [311]:
for animal,df in g :
    print(df)
    print() ## new line

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  1.5       3       no
h    cat  NaN       1      yes

  animal  age  visits priority
d    dog  NaN       3      yes
e    dog  5.0       2       no
i    dog  7.0       2       no
j    dog  3.0       1       no

  animal  age  visits priority
c  snake  0.5       2       no
g  snake  4.5       1       no

In [312]:
df.groupby('animal')['age'].agg('mean')

animal
snake    2.5
Name: age, dtype: float64

In [313]:
df.groupby('animal')['age'].mean()

animal
snake    2.5
Name: age, dtype: float64

### 16. Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.

In [314]:
df.loc['k'] = ['monkey', 2, 3, 'yes']
df.drop(index=['k'], inplace=True)
df

  animal  age  visits priority
c  snake  0.5       2       no
g  snake  4.5       1       no

^^ 
Using inplace=True in the drop() method ensures that the operation modifies the original DataFrame df in place, without returning a new DataFrame. If inplace=True is not used, the drop() method will return a new DataFrame with the specified rows removed, but the original DataFrame df will remain unchanged.

### 17. Count the number of each type of animal in df.

In [315]:
animal_counts = df['animal'].value_counts()
print(animal_counts)

animal
snake    2
Name: count, dtype: int64

### 18. Sort df first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order (so row i should be first, and row d should be last).

In [316]:
df

  animal  age  visits priority
c  snake  0.5       2       no
g  snake  4.5       1       no

In [317]:
df.sort_values(by="visits",ascending=False)

  animal  age  visits priority
c  snake  0.5       2       no
g  snake  4.5       1       no

In [318]:
df.sort_values(by=["visits","age"])

  animal  age  visits priority
g  snake  4.5       1       no
c  snake  0.5       2       no

In [319]:
df.sort_values(by=['age', 'visits'], ascending=[False, True])

  animal  age  visits priority
g  snake  4.5       1       no
c  snake  0.5       2       no

### 19. The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.

In [320]:
df.replace({
    "no":"False",
    "yes" : "True"
})

  animal  age  visits priority
c  snake  0.5       2    False
g  snake  4.5       1    False

In [321]:
df.replace(["yes","no"],["True","False"])

  animal  age  visits priority
c  snake  0.5       2    False
g  snake  4.5       1    False

### 20. In the 'animal' column, change the 'snake' entries to 'python'.

In [322]:
df.replace(["snake"],["Python"])

   animal  age  visits priority
c  Python  0.5       2       no
g  Python  4.5       1       no

In [323]:
df['animal'].replace({'snake': 'python'}, inplace=True)
df

C:\Users\SPPL IT\AppData\Local\Temp\ipykernel_2460\1807925252.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['animal'].replace({'snake': 'python'}, inplace=True)

   animal  age  visits priority
c  python  0.5       2       no
g  python  4.5       1       no

### 21. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [324]:
for animal,df in g :
    print(df)
    print() ## new line

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  1.5       3       no
h    cat  NaN       1      yes

  animal  age  visits priority
d    dog  NaN       3      yes
e    dog  5.0       2       no
i    dog  7.0       2       no
j    dog  3.0       1       no

  animal  age  visits priority
c  snake  0.5       2       no
g  snake  4.5       1       no

In [325]:
pivot_table = df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')
pivot_table

visits    1    2
animal
snake   4.5  0.5

## DataFrames: beyond the basics

##### Difficulty: medium

### 22. You have a DataFrame df with a column 'A' of integers. 

#### For example:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

How do you filter out rows which contain the same integer as the row immediately above?

You should be left with a column containing the following values:

1, 2, 3, 4, 5, 6, 7

In [326]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [327]:
df_new = df["A"].unique()
pd.DataFrame(df_new)

##WORNG APPROACH!!

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7

In [328]:
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [329]:
df['A'].shift()

0     NaN
1     1.0
2     2.0
3     2.0
4     3.0
5     4.0
6     5.0
7     5.0
8     5.0
9     6.0
10    7.0
Name: A, dtype: float64

In [330]:
df['A'] != df['A'].shift()

0      True
1      True
2     False
3      True
4      True
5      True
6     False
7     False
8      True
9      True
10    False
Name: A, dtype: bool

In [331]:
filtered_df = df[df['A'] != df['A'].shift()] ## ONLY TRUE VALUES WILL BE PRINTED 

filtered_df

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

### 23. Given a DataFrame of numeric values, say

df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values

how do you subtract the row mean from each element in the row?

In [332]:
df = pd.DataFrame(np.ones((5, 3))) # a 5x3 frame of float values
df

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0
3  1.0  1.0  1.0
4  1.0  1.0  1.0

In [333]:
df.mean(axis=1)

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
dtype: float64

In [334]:
df.sub(df.mean(axis=1), axis=0)

     0    1    2
0  0.0  0.0  0.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  0.0  0.0
4  0.0  0.0  0.0

In [335]:
df = df - df.mean()
df

     0    1    2
0  0.0  0.0  0.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  0.0  0.0
4  0.0  0.0  0.0

### 24. Suppose you have DataFrame with 10 columns of real numbers, for example:

df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))

Which column of numbers has the smallest sum? Return that column's label.

In [336]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.495859,0.706008,0.161483,0.585998,0.963265,0.125282,0.726395,0.303188,0.360698,0.377265
1,0.277954,0.918521,0.032397,0.576051,0.007719,0.397752,0.233723,0.759447,0.411230,0.153236
2,0.419099,0.687597,0.889911,0.997228,0.933256,0.704736,0.130194,0.956640,0.080971,0.210711
3,0.470091,0.740625,0.281745,0.410746,0.479005,0.592400,0.288401,0.472169,0.103709,0.283541
4,0.257805,0.809257,0.464945,0.312732,0.588460,0.207015,0.682673,0.997625,0.937309,0.471782

In [337]:
df.sum()

a    1.920807
b    3.862007
c    1.830481
d    2.882754
e    2.971704
f    2.027186
g    2.061387
h    3.489069
i    1.893918
j    1.496535
dtype: float64

In [338]:
df.sum().min()

1.4965345518319801

In [339]:
df.sum().idxmin()

'j'

In [340]:
df.sum().idxmax()

'b'

### 25. How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)? 
As input, use a DataFrame of zeros and ones with 10 rows and 3 columns.

In [341]:
np.random.randint (0,1)

0

In [342]:
np.random.randint(0, 2, size=(10, 3))

array([[0, 1, 0],
       [0, 1, 0],
       [1, 0, 1],
       [0, 0, 1],
       [1, 0, 0],
       [1, 0, 1],
       [0, 1, 1],
       [0, 1, 0],
       [0, 1, 0],
       [1, 1, 0]])

In [343]:
df = pd.DataFrame(np.random.randint(0, 2, size=(5, 3)))
df

   0  1  2
0  1  0  0
1  1  0  0
2  1  1  0
3  0  1  1
4  0  1  0

In [344]:
df = df.drop_duplicates() ## drops duplicate rows
df

   0  1  2
0  1  0  0
2  1  1  0
3  0  1  1
4  0  1  0

### 26. In the cell below, you have a DataFrame df that consists of 10 columns of floating-point numbers. Exactly 5 entries in each row are NaN values.

For each row of the DataFrame, find the column which contains the third NaN value.

You should return a Series of column labels: e, c, d, h, d

In [345]:
nan=np.nan
data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

col= ["a","b","c","d","e","f","g","h","i","j"]

p=pd.DataFrame(data,columns=col)
p

      a   b     c     d     e     f     g     h     i     j
0  0.04 NaN   NaN  0.25   NaN  0.43  0.71  0.51   NaN   NaN
1   NaN NaN   NaN  0.04  0.76   NaN   NaN  0.67  0.76  0.16
2   NaN NaN  0.50   NaN  0.31  0.40   NaN   NaN  0.24  0.01
3  0.49 NaN   NaN  0.62  0.73  0.26  0.85   NaN   NaN   NaN
4   NaN NaN  0.41   NaN  0.05   NaN  0.61   NaN  0.48  0.68

In [346]:
p.isna()

       a     b      c      d      e      f      g      h      i      j
0  False  True   True  False   True  False  False  False   True   True
1   True  True   True  False  False   True   True  False  False  False
2   True  True  False   True  False  False   True   True  False  False
3  False  True   True  False  False  False  False   True   True   True
4   True  True  False   True  False   True  False   True  False  False

In [347]:
p[p.isna()]

    a   b   c   d   e   f   g   h   i   j
0 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
4 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN

In [348]:
def third_nan_col(row):
    nan_cols = row.index[row.isna()]
    return nan_cols[2] if len(nan_cols) >= 3 else None

result_series = p.apply(third_nan_col, axis=1)

print(result_series)

0    e
1    c
2    d
3    h
4    d
dtype: object

# PROBLEM ^^

### 27. A DataFrame has a column of groups 'grps' and and column of integer values 'vals':

df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 

                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

For each group, find the sum of the three greatest values. You should end up with the answer as follows:


grps

a               409

b                156

c               345

In [349]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

df

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [350]:
g= df.groupby("grps")

In [351]:
for grps,df in g:
    print(df)
    print()

  grps  vals
0    a    12
1    a   345
2    a     3
6    a     4
7    a    52

   grps  vals
3     b     1
4     b    45
8     b    54
12    b    57
13    b     3

   grps  vals
5     c    14
9     c    23
10    c   235
11    c    21
14    c    87

In [352]:
group_sums = df.groupby('grps')['vals'].sum() ### TOTAL SUM
print(group_sums)

grps
c    380
Name: vals, dtype: int64

In [353]:
def sum_of_three_greatest(group):
    sorted_vals = group.sort_values(ascending=False) ###
    return sorted_vals.iloc[:3].sum()

In [354]:
df.groupby('grps')['vals'].apply(sum_of_three_greatest).reset_index()

  grps  vals
0    c   345

### 28. The DataFrame df constructed below has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive).


For each group of 10 consecutive integers in 'A' (i.e. (0, 10], (10, 20], ...), calculate the sum of the corresponding values in column 'B'.

#### || SKIPPED 28 ###

## DataFrames: harder problems

### 29. Consider a DataFrame df where there is an integer column 'X':


df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be


[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]
Make this a new column 'Y'.

### 30. Consider the DataFrame constructed below which contains rows and columns of numerical data.


Create a list of the column-row index locations of the 3 largest values in this DataFrame. In this case, the answer should be:


[(5, 7), (6, 4), (2, 5)]

### 31. You are given the DataFrame below with a column of group IDs, 'grps', and a column of corresponding integer values, 'vals'.


df = pd.DataFrame({"vals": np.random.RandomState(31).randint(-30, 30, size=15), 
                   "grps": np.random.RandomState(31).choice(["A", "B"], 15)})
                   
Create a new column 'patched_values' which contains the same values as the 'vals' any negative values in 'vals' with the group mean:

### 32. Implement a rolling mean over groups with window size 3, which ignores NaN value. For example consider the following DataFrame:


>>> df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})

|| SKIPPED (29-32) The Harder Problems

# Series and DatetimeIndex

### Exercises for creating and manipulating Series with datetime data
##### Difficulty: easy/medium

### 33. Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers. Let's call this Series s.

In [355]:
business_days = pd.bdate_range("2015-01-01", "2015-12-31") ##Prints business days

In [356]:
values = np.random.randint(100,size=len(business_days))
values

array([34, 51, 48, 99,  0, 21, 71, 60,  5,  3, 53, 42, 13, 73, 67, 88, 86,
       21, 79, 45, 45, 13, 87, 57, 44, 73, 13, 86, 62, 73, 32, 74, 96, 46,
       53, 45, 96, 37, 12, 18,  0, 86, 74, 59, 38,  5, 88, 50, 18, 89, 68,
       58, 94, 17, 15, 62, 80, 71, 58, 78, 88, 34, 27, 39, 41, 11, 29, 69,
        4, 65, 12, 84, 44, 32,  6, 91, 27, 46, 66, 81, 89, 49,  9, 49, 19,
       27, 70, 80, 98, 30, 33, 42,  0, 77, 38, 96, 59, 93, 48, 61, 67,  1,
       36, 69, 31, 68, 83, 46, 59,  0, 98, 32, 83, 95,  0, 49, 29, 33, 67,
       46, 24, 28, 39, 78, 31, 18, 73, 35, 20, 17, 23, 58, 77, 20, 29, 23,
        9, 94, 11, 21, 23, 68, 33, 34,  2, 28, 39, 47,  3, 82, 14,  1, 66,
       93, 97, 74, 69, 10, 85, 84, 13, 98, 93,  7, 47, 53, 53, 54, 22, 94,
       29, 93, 30, 87, 28, 76, 64, 99, 90, 77, 53, 39, 39, 13, 41,  0, 89,
       12, 36, 83, 58, 54, 91, 43, 89, 74, 85, 48, 88, 80,  5, 46, 42, 63,
       61, 71, 42, 32,  9, 89, 71, 78, 86, 16, 70, 33, 15, 15, 47, 31, 92,
       86, 42, 57, 67, 74, 65, 27, 37, 60, 13, 96, 14, 41, 79, 71, 58, 70,
       58, 43, 92, 12, 36, 45,  9,  7, 76, 96, 92, 10, 97, 76, 44, 41, 30,
       41, 63, 76, 38, 88, 81])

In [357]:
s= pd.Series(values ,index = business_days )
s

2015-01-01    34
2015-01-02    51
2015-01-05    48
2015-01-06    99
2015-01-07     0
              ..
2015-12-25    63
2015-12-28    76
2015-12-29    38
2015-12-30    88
2015-12-31    81
Freq: B, Length: 261, dtype: int32

### 34. Find the sum of the values in s for every Wednesday.

In [358]:
s.index

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-05', '2015-01-06',
               '2015-01-07', '2015-01-08', '2015-01-09', '2015-01-12',
               '2015-01-13', '2015-01-14',
               ...
               '2015-12-18', '2015-12-21', '2015-12-22', '2015-12-23',
               '2015-12-24', '2015-12-25', '2015-12-28', '2015-12-29',
               '2015-12-30', '2015-12-31'],
              dtype='datetime64[ns]', length=261, freq='B')

In [359]:
s.index.day_name()

Index(['Thursday', 'Friday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday',
       'Friday', 'Monday', 'Tuesday', 'Wednesday',
       ...
       'Friday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday',
       'Monday', 'Tuesday', 'Wednesday', 'Thursday'],
      dtype='object', length=261)

In [360]:
count = 0
for index_date in s.index:
    if index_date.day_name() == "Wednesday":
        count = count+1

print("Count of Wednesdays:", count)  ##counting total wednesday

Count of Wednesdays: 52

In [361]:
s[s.index.day_name() == "Wednesday"]

2015-01-07     0
2015-01-14     3
2015-01-21    67
2015-01-28    45
2015-02-04    44
2015-02-11    73
2015-02-18    53
2015-02-25    18
2015-03-04    38
2015-03-11    89
2015-03-18    15
2015-03-25    78
2015-04-01    41
2015-04-08    65
2015-04-15     6
2015-04-22    81
2015-04-29    19
2015-05-06    30
2015-05-13    38
2015-05-20    61
2015-05-27    31
2015-06-03     0
2015-06-10     0
2015-06-17    46
2015-06-24    31
2015-07-01    17
2015-07-08    29
2015-07-15    21
2015-07-22     2
2015-07-29    82
2015-08-05    97
2015-08-12    84
2015-08-19    47
2015-08-26    94
2015-09-02    28
2015-09-09    77
2015-09-16    41
2015-09-23    83
2015-09-30    89
2015-10-07    80
2015-10-14    61
2015-10-21    89
2015-10-28    70
2015-11-04    31
2015-11-11    67
2015-11-18    60
2015-11-25    79
2015-12-02    43
2015-12-09     9
2015-12-16    10
2015-12-23    30
2015-12-30    88
dtype: int32

In [362]:
wednesday_sum = s[s.index.day_name() == "Wednesday"].sum()
wednesday_sum

2480

### 35. For each calendar month in s, find the mean of values.

In [363]:
months = s.index.month_name()
months

Index(['January', 'January', 'January', 'January', 'January', 'January',
       'January', 'January', 'January', 'January',
       ...
       'December', 'December', 'December', 'December', 'December', 'December',
       'December', 'December', 'December', 'December'],
      dtype='object', length=261)

In [364]:
a = s.groupby(months).mean()
a

April        43.181818
August       60.190476
December     54.391304
February     54.500000
January      46.227273
July         32.869565
June         44.681818
March        55.000000
May          56.190476
November     54.380952
October      54.727273
September    57.318182
dtype: float64

In [365]:
a.sort_values()

July         32.869565
April        43.181818
June         44.681818
January      46.227273
November     54.380952
December     54.391304
February     54.500000
October      54.727273
March        55.000000
May          56.190476
September    57.318182
August       60.190476
dtype: float64

In [366]:
a.sort_index()

April        43.181818
August       60.190476
December     54.391304
February     54.500000
January      46.227273
July         32.869565
June         44.681818
March        55.000000
May          56.190476
November     54.380952
October      54.727273
September    57.318182
dtype: float64

In [367]:
a = a.reindex(['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December'])  # Sort the mean values by month names
a

January      46.227273
February     54.500000
March        55.000000
April        43.181818
May          56.190476
June         44.681818
July         32.869565
August       60.190476
September    57.318182
October      54.727273
November     54.380952
December     54.391304
dtype: float64

In [368]:
s.resample("M").mean()

C:\Users\SPPL IT\AppData\Local\Temp\ipykernel_2460\377855557.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  s.resample("M").mean()

2015-01-31    46.227273
2015-02-28    54.500000
2015-03-31    55.000000
2015-04-30    43.181818
2015-05-31    56.190476
2015-06-30    44.681818
2015-07-31    32.869565
2015-08-31    60.190476
2015-09-30    57.318182
2015-10-31    54.727273
2015-11-30    54.380952
2015-12-31    54.391304
Freq: ME, dtype: float64

### 36. For each group of four consecutive calendar months in s, find the date on which the highest value occurred.

In [369]:
 s.resample('4M').max()

C:\Users\SPPL IT\AppData\Local\Temp\ipykernel_2460\2826011332.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  s.resample('4M').max()

2015-01-31    99
2015-05-31    98
2015-09-30    99
2016-01-31    97
Freq: 4ME, dtype: int32

In [370]:
s.groupby(pd.Grouper(freq='4M')).idxmax()

C:\Users\SPPL IT\AppData\Local\Temp\ipykernel_2460\1554433663.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  s.groupby(pd.Grouper(freq='4M')).idxmax()

2015-01-31   2015-01-06
2015-05-31   2015-05-05
2015-09-30   2015-09-07
2016-01-31   2015-12-17
Freq: 4ME, dtype: datetime64[ns]

### 37. Create a DateTimeIndex consisting of the third Thursday in each month for the years 2015 and 2016.

In [373]:
pd.date_range("2015-01-01", "2016-12-31",freq='WOM-3THU')

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

INFO : 

'ChatGPT'

The parameter freq='WOM-3THU' is a frequency specification used by Pandas to generate dates. Let's break it down:

WOM: This stands for "Week Of Month". It's used to specify which week of the month to consider.
-3: This indicates the third week of the month.
THU: This specifies the day of the week, which in this case is Thursday.
So, WOM-3THU specifies the third Thursday of each month.

There are various other frequency specifications you can use with Pandas to generate different date ranges. Some common ones include:

'D': Daily frequency
'W': Weekly frequency
'M': Month end frequency
'A': Year end frequency
'H': Hourly frequency
And many more. You can also combine these with other options like specifying which day of the week or which week of the month, as we did with 'WOM-3THU'. This flexibility allows you to generate date ranges that meet specific requirements for your analysi

## Cleaning Data

In [375]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### 38. Some values in the the FlightNumber column are missing (they are NaN). These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Modify df to fill in these missing numbers and make the column an integer column (instead of a float column).

In [392]:
df['FlightNumber'] = np.arange(10045,10086,10)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

### 39. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame called 'temp' with the correct values. Assign the correct column names 'From' and 'To' to this temporary DataFrame.

In [393]:
temp =df.copy()

In [395]:
temp[['From', 'To']] = temp['From_To'].str.split('_', expand=True)
temp = temp.drop(columns=['From_To'])
temp

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

### 40. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame 'temp'. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [403]:
temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()
temp

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London